sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f4.c
/**
* @file        ExtFlash.c
*
* @brief       manager for SPI Flash - Implementation for stm32f4xx device
*
* @author      Nick
*
* @riskClass   C
*
* @moduleID
*
* @vcsInfo
*     $Id: ExtFlash_stm32f4.c 599 2024-09-26 07:03:24Z stefano $
*
*     $Revision: 599 $
*
*     $Author: 
*
*     $Date: 2024-09-26 09:03:24 +0200 (gio, 26 set 2024) $
*
*
* @copyright
*       Copyright (C) 2017 SCAME S.p.A. All rights reserved.
*       This file is copyrighted and the property of Aesys S.p.A.. It contains confidential and proprietary
*       information. Any copies of this file (in whole or in part) made by any method must also include a copy of this
*       legend.
*       Developed by:  SCAME S.p.A.
***********************************************************************************************************************/

/************************************************************
 * Include
 ************************************************************/
#include <string.h>
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_dma.h"
#include "ff.h"
#include "ffconf.h"
#include "main.h"
#include "ExtFlash.h"
#include "cmsis_os.h"
#include "wrapper.h"   

/*
*********************************** AESYS ************************************
**                                                                          **
**                            Global Variables                              **
**                                                                          **
******************************************************************************
*/
// Struttura FAT simulata su QSPI
struct StructFAT FAT;

// Tipo di Serial Flash
unsigned char sFLASH_Model;

// Info sulla Serial FLASH in uso
sFLASH_Info sFLASH_Information;

unsigned char FlashID[10];
unsigned char WriteOptimization;

// Dettagli dimensioni flash QSPI
unsigned int FlashDimBlk, FlashDimPag;

// Puntatore al buffer di backup
unsigned int  PBackupQSPI;


/*
*********************************** AESYS ************************************
**                                                                          **
**                            Local  Variables                              **
**                                                                          **
******************************************************************************
*/

/*
*********************************** AESYS ************************************
**                                                                          **
**                            External Variables                            **
**                                                                          **
******************************************************************************
*/
// Struttura per pilotare la sFLASH
extern SPI_HandleTypeDef hspi1;

// Semaforo
extern osSemaphoreId FlashSemaphoreHandle;


/*
*********************************** AESYS ************************************
**                                                                          **
**                            External Function                             **
**                                                                          **
******************************************************************************
*/


/*
*********************************** AESYS ************************************
**                                                                          **
**                            Internal Function prototype                   **
**                                                                          **
******************************************************************************
*/
// Funzioni gestione flash
static uint8_t sFLASH_WriteEnable               (void);
static uint8_t sFLASH_WaitForWriteInProgress   (uint32_t Timeout);
static uint8_t sFLASH_Read                      (uint8_t* pData, uint32_t ReadAddr, uint32_t Size);
static uint8_t sFLASH_Write                     (uint8_t* pData, uint32_t WriteAddr, uint32_t Size);
static uint8_t sFLASH_GetStatusReg1             (uint8_t *reg);
static uint8_t sFLASH_GetConfigReg1             (uint8_t *reg);
static uint8_t sFLASH_Erase_SubBlock            (uint32_t BlockAddress);

//-----------------------------------------------------------------
// Inizio routine gestione FLASH a basso livello
//-----------------------------------------------------------------

/**
  * @brief  This function send a byte using the SPI, checking the result
  * @retval Result as OK or ERROR
  */
static uint8_t sFLASH_SendByte(uint8_t Data)
{
  /* Transmit byte via SPI */
  if (HAL_SPI_Transmit(&hspi1, &Data, sizeof(uint8_t), SPI_TIMEOUT_VALUE) != HAL_OK) 
  {
    return HAL_ERROR;
  }
  
  return HAL_OK;
}

/**
  * @brief  This function send and receive a byte using the SPI, checking the result
  * @retval Result as OK or ERROR
  */
static uint8_t sFLASH_SendReceiveByte(uint8_t Data, uint8_t *pRetData)
{
  /* Transmit and receive byte via SPI */
  if (HAL_SPI_TransmitReceive(&hspi1, &Data, pRetData, sizeof(uint8_t), SPI_TIMEOUT_VALUE) != HAL_OK) 
  {
    return HAL_ERROR;
  }
  
  return HAL_OK;
}

/**
  * @brief  This function receive a block of data from the SPI
  * @retval Result as OK or ERROR
  */
static uint8_t sFLASH_ReceiveData(uint8_t *pData, uint16_t Size)
{
  /* Receive a block of data via SPI */
  if (HAL_SPI_Receive(&hspi1, pData, Size, SPI_TIMEOUT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }
  
  return HAL_OK;
}

/**
  * @brief  This function transmit a block of data to the SPI
  * @retval Result as OK or ERROR
  */
static uint8_t sFLASH_TransmitData(uint8_t *pData, uint16_t Size)
{
  /* Transmit a block of data via SPI */
  if (HAL_SPI_Transmit(&hspi1, pData, Size, SPI_TIMEOUT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }
  
  return HAL_OK;
}


/**
  * @brief  This function send a Write Enable and wait it is effective.
  * @retval Result as OK or ERROR
  */
static uint8_t sFLASH_WriteEnable(void)
{
  
  /* Put NSS to LOW level */
  NSS_TO_LOW_LEVEL 
    
  /* Transmit command used to unlock the device */
  if (sFLASH_SendByte(WRITE_ENABLE_CMD) != HAL_OK)
  {
    return HAL_ERROR;
  }
  
  /* Put NSS to HIGH level */
  NSS_TO_HIGH_LEVEL

  return HAL_OK;
}

/**
  * @brief  This function read the SR of the memory and wait the EOP.
  * @retval Result as OK or ERROR
  */
static uint8_t sFLASH_WaitForWriteInProgress(uint32_t Timeout)
{
  uint8_t StatusReg;
    
  uint32_t tickstart = HAL_GetTick();
  
  
  do {

    /* Put NSS to LOW level */
    NSS_TO_LOW_LEVEL  
    
    /* Transmit command used to unlock the device */
    if (sFLASH_SendByte(READ_STATUS_REG_CMD) != HAL_OK)
    {
      return HAL_ERROR;
    }
        
