sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f4.c
}

/**
  * @brief  Erases the specified sub-block of the QSPI memory.
  * @param  BlockAddress: Block address to erase
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Erase_SubBlock(uint32_t BlockAddress)
{
  return(sFLASH_Erase_SubBlock(BlockAddress));
}

/**
  * @brief  Writes an amount of data to the QSPI memory.
  * @param  pData: Pointer to data to be written
  * @param  WriteAddr: Write start address
  * @param  Size: Size of data to write
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Write(uint8_t* pData, uint32_t WriteAddr, uint32_t Size)
{
  refreshWD();
  return(sFLASH_Write(pData, WriteAddr, Size));
}

/**
  * @brief  Reads an amount of data to the QSPI memory.
  * @param  pData: Pointer where data read is stored
  * @param  ReadAddr: Read start address
  * @param  Size: Size of data to read
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Read(uint8_t* pData, uint32_t ReadAddr, uint32_t Size)
{
  return(sFLASH_Read(pData, ReadAddr, Size));
}

/**
  * @brief  Erase data area in QSPI-Flash.
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_EraseDataArea(void)
{
  uint32_t      qspiAdd;
  uint8_t       result;
  
  for (qspiAdd = FLASH_FWFILE_SIZE; qspiAdd < sFLASH_Information.FlashSize; qspiAdd += EXT_FLASH_SUBSECTOR_SIZE)
  {
    result = raw_sFLASH_Erase_SubBlock(qspiAdd);
    refreshWD();

    if (result != HAL_OK)
    {
      break;
    }
  }

  return(result);
}

/**
  * @brief  Erase data area in QSPI-Flash.
  * @param  none
  * @retval char*: pointer to start address data area in QSPI flash
  */
char* pQspiDataArea(void)
{
  return((char*)FLASH_FWFILE_SIZE);
}


uint8_t getStatusReg(void)
{
  uint8_t statusReg;

  sFLASH_GetStatusReg1(&statusReg);
  return (statusReg);
}

uint8_t getConfigReg(void)
{
  uint8_t configReg;

  sFLASH_GetConfigReg1(&configReg);
  return (configReg);
}


/**
  * @brief  Get address transaction start area
  * @param  none
  * @retval uint32_t: pointer to start address transaction data area in QSPI flash
  */
uint32_t getTransactionAddress(void)
{
  return (sFLASH_Information.transactionAddress);
}

//-----------------------------------------------------------------

